{
    "architectures": ["MiniCPMForCausalLM"],
    "bos_token_id": 1,
    "dim_model_base": 256,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 2304,
    "initializer_range": 0.1,
    "intermediate_size": 5760,
    "max_position_embeddings": 4096,
    "model_type": "minicpm",
    "num_attention_heads": 36,
    "num_hidden_layers": 40,
    "num_key_value_heads": 36,
    "quantization": {
        "group_size": 64,
        "bits": 4
    },
    "rms_norm_eps": 1e-5,
    "rope_scaling": null,
    "scale_depth": 1.4,
    "scale_emb": 12,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.36.0",
    "use_cache": true,
    "vocab_size": 122753
}
